# Инвариантная самостоятельная работа

### [3.1. Создание аннотированного списка библиотек для работы с текстом в Python.]()
### [3.2. Разработка сценария с реализацией операции поиска подстроки в тексте. ](https://repl.it/@PolinaLazebniko/Tema6-ISR-Zad32)
```python
"""
    Лазебникова Полина 
    ИВТ 2 курс
    группа 1.1

    Инвариантная самостоятельная работа 
    Задание 3.2: Разработка сценария с реализацией операции поиска подстроки в тексте.
"""

def search_all_str(input_str_f, searchable_str_f): 
    """
    Функция для поиска подстроки 

    Входные данные - строка для поиска, строка, по которой идет поиск

    Сначала ищет первое вхождение подстроки, и далее последующие, если вхождений нет, то выводит сообщение об этом
    """
    rec = searchable_str_f.find(input_str_f)
    if rec != -1:
        print('Первое вхождение подстроки: ', rec)
    else:
        print('Нет вхождений подстроки')
    while rec != -1:
        rec = searchable_str_f.find(input_str_f, rec + len(input_str_f), len(searchable_str_f))
        if rec != -1:
            print('Вхождение подстроки: ', rec)
        else:
            print('Больше нет вхождений')

def main():
    """
    Функция, которая принимает от пользователя строку для поиска и строку, по которой идет поиск и 
    вызывает функцию search_all_str  
    """
    input_str = input("Введите строку для поиска: ")
    searchable_str = input("Введите строку, по которой идет поиск: ")    
    search_all_str(input_str, searchable_str)

main()
```
### [3.3. Создание скрипта для считывания данных справочных логов из текстового файла и преобразования их в CSV-формат с последующей записью в новый файл.](https://repl.it/@PolinaLazebniko/Tema6-ISR-Zad33)
```python
"""
    Лазебникова Полина 
    ИВТ 2 курс
    группа 1.1

    Инвариантная самостоятельная работа 
    Задание 3.3: Создание скрипта для считывания данных справочных логов из текстового файла и преобразования их в CSV-формат с последующей записью в новый файл.
"""

import json
import csv

def json_f():
    """
    Функция для работы с json
    """
    handle = open('MOCK_DATA.json')
    lines = json.load(handle)
    return lines

def csv_f(lines):
    """
    Функция для работы с csv
    """
    with open('eggs.csv', 'w', newline='') as csvfile:
        csv_writer = csv.writer(
            csvfile, delimiter=';', quotechar='"',
            quoting=csv.QUOTE_MINIMAL)
        csv_writer.writerow(list(lines[0].keys()))
        for line in lines:
            csv_writer.writerow(list(line.values()))

csv_f(json_f())
```
### [3.4. Реализовать программу шифрующую строку, задаваемую пользователем, с помощью алгоритма шифрования ROT13.]()
```python

```
# Вариативная самостоятельная работа

### [3.1. Реализация программы-игры «Угадай число», в которой для вывода на экран информации использовать метод format.](https://repl.it/@PolinaLazebniko/Tema6-VSR-Zad31)
```python
"""
    Лазебникова Полина 
    ИВТ 2 курс
    группа 1.1

    Вариативная самостоятельная работа

    Задание 3.1: Реализовать программу-игру «Угадай число», в которой для вывода на экран информации использовать метод format.  
"""

import random

print ("Игра 'Угадай число'") 
print ("Загадано число от 1 до 99")
print ("Дается 10 попыток, чтобы его угадать")
number = random.randint(1,99)
attempts = 0

while attempts < 10:
    print("Какое число загадано?")
    guess = int(input())
    attempts = attempts + 1
    if guess < number:
        print("Угадываемое число больше")
    if guess > number:
        print("Угадываемое число меньше")
    if guess == number:
        break
if guess == number:
    attempts = str(attempts)
    print("{}, ты угадал число! Количество попыток, которое тебе потребовалось: {}".format("Здорово", attempts))
if guess != number:
    number = str(number)
    print("{}, но попыток не осталось. Ты проиграл. Я загадал число {}".format("Жаль", number))
```
### [3.2. Программа, выводящая на экран последовательно символы английского и кириллического алфавита с использованием кодов из таблицы unicode-символов.](https://repl.it/@PolinaLazebniko/Tema5-VSR-Zad22)
```python
"""
    Лазебникова Полина 
    ИВТ 2 курс
    группа 1.1

    Вариативная самостоятельная работа

    Задание 3.2: Написать программу, выводящую на экран последовательно символы английского и кириллического алфавита с использованием кодов из таблицы unicode-символов. 
"""

def abc(a,b):
    """
    Функция для вывода символов английского и кириллического алфавита с использованием кодов из таблицы unicode-символов

    Входные данные - код первого и последнего символов для каждого алфавита
    Выходные данные - символы алфавита 

    Преобразует код из таблицы unicode-символов и выводит сам символ.
    """
    for i in range(a,b):
        print (chr(i), end=' ')

print('EN capital letters:')
print(abc(65,91))
print('EN small letters:')
print(abc(97,123))
print('RU capital letters:')
print(abc(1040,1072))
print('RU small letters:')
print(abc(1072,1104))
```
