# Инвариантная самостоятельная работа

### [2.1. Разработка скрипта с функцией, которая строит таблицу истинности для логического выражения (по вариантам) для двух и трех аргументов (используются различные наборы значений аргументов).]()
```python

```
### [2.2. Разработка программы, которая выводит на экран с помощью ASCII-графики таблицу истинности на основе переданных ей на вход аргументов (логическое выражение, аргументы, результат вычисления выражения). ]()
```python

```
### [2.3. Разработка скрипта с функцией, которая для ряда Фибоначчи, где количество элементов, n = 22, возвращает подмножество значений или единственное значение (по вариантам). Для нахождения элемента требуется использовать слайсы](https://repl.it/@PolinaLazebniko/Tema5-ISR-Zad23)
```python
"""
    Лазебникова Полина 
    ИВТ 2 курс
    группа 1.1

    Инвариантная самостоятельная работа 
    Задание 2.3: Разработать скрипт с функцией, которая для ряда Фибоначчи, где количество элементов, n = 22, 
    возвращает подмножество значений или единственное значение (по вариантам). Для нахождения элемента 
    требуется использовать слайсы. 
"""

def fib(n):
    """
    Функция для нахождения ряда Фибоначчи

    Входные данные - количество элементов ряда

    Находит все значения элементов ряда, количество которых определяется пользователем, записывая их в список. 
    Далее предоставляет выбор того, что требуется вывести   
    """
    fib1 = 1
    fib2 = 1
    a = [fib1, fib2]
    i = 0
    while i < n - 2:
        fib_sum = fib1 + fib2
        fib1 = fib2
        fib2 = fib_sum
        i += 1
        a.append(fib2) 
    print(a)

    choice = None
    while choice != '3':
        print('1 - вывод всех значений ряда')
        print('2 - вывод значения последнего элемента')
        print('3 - для выхода')
        choice = input("Сделайте  выбор (1..3) ")
        
        if choice == '1':
            print(a)
            #print(a[1:]) -если без первой 1

        if choice == '2':
            print(a[n-1:])
            
def main():
    """
    Функция, которая принимает от пользователя количество элементов ряда и обращается к функции fib
    """
    n = int(input("Введите количество элементов ряда Фибоначчи: "))
    fib(n)

main()
```
### [2.4. Разработка программы с функцией, в которой будет реализовано решение физической задачи.](https://repl.it/@PolinaLazebniko/Tema5-ISR-Zad24)
```python
"""
    Лазебникова Полина 
    ИВТ 2 курс
    группа 1.1

    Вариант 4

    Инвариантная самостоятельная работа 
    Задание 2.4: Напишите программу с функцией, в которой будет реализовано решение физической задачи.  
    В правильной четырехугольной пирамиде высота равна h, объем равен v. Найдите боковое ребро 
    этой пирамиды. Решение оформите в виде функции rib(h,v), которая возвращает результат l. Например,
    при h=12; v=200 функция rib(12,200) вернет l=13
"""

import math

def rib(h, v):
    """
    Функция для нахождения бокового ребра пирамиды

    Входные данные - высота и объем пирамиды
    Выходные данные - длина бокового ребра

    Находит все значения элементов ряда, количество которых определяется пользователем, 
    записывая их в список. Далее предоставляет выбор того, что требуется вывести   
    """
    s = 3 * v / h
    a = math.sqrt(s)
    d = a * math.sqrt(2)
    l = math.sqrt(d/2 * d/2 + h * h)

    return l

def main():
    """
    Функция, которая принимает от пользователя значения высоты и объема, затем
    выводит результат обращается к функции rib
    """
    print("Дана правильная четырехугольная пирамида")
    h = int(input("Введите высоту h в см: "))
    v = int(input("Введите объем V в см^3: "))
    print("Длина бокового ребра: {} см".format(rib(h, v)))

main()
```
# Вариативная самостоятельная работа

### [2.1. Исследование способов преобразования программного кода Python в соответствии со стандартом PEP8. Составить сравнительную таблицу с анализом.]()
### [2.2. Разработка программы, которая для заданного количества значений возвращала бы список из повторяющихся элементов, содержащихся во входном наборе значений. ](https://repl.it/@PolinaLazebniko/Tema5-VSR-Zad22)
```python
"""
    Лазебникова Полина 
    ИВТ 2 курс
    группа 1.1

    Вариативная самостоятельная работа 
    Задание 2.2: Разработать программу, которая для заданного количества значений возвращала бы список из 
    повторяющихся элементов, содержащихся во входном наборе значений. Использовать упаковку и распаковку
    элементов.
"""

def repeating_element(*args):
    """    
    Функция для нахождения повторяющихся элементов, содержащихся во входном наборе значений

    Входные данные - набор значений
    Выходные данные - повторяющиеся элементы

    Находит все повторяющиеся значений и добавляет их в конец списка, далее с помощью множества 
    делает так, чтобы значения не повторялись, и возвращает список повторяющихся элементов    
    """
    repeat_arr = []
    for i in range(len(args)):
        for j in range(len(args)):
            if args[i] == args[j] and i != j:
                repeat_arr.append(args[i])
    repeat_arr = list(set(repeat_arr))
    
    return repeat_arr

print(repeating_element(8, 1, 1, 'b', 8, 3, 5, 8, 9, 'a', 'a', 9))
```
### [2.3. Лямбда-функцию, генерирующую квадраты чисел из переменной типа list, через генератор списка.](https://repl.it/@PolinaLazebniko/Tema5-VSR-Zad23)
```python
"""
    Лазебникова Полина 
    ИВТ 2 курс
    группа 1.1

    Вариативная самостоятельная работа

    Задание 2.3: Перепишите лямбда-функцию, генерирующую квадраты чисел из переменной
    типа list, через генератор списка.
"""

a = [i for i in range(1,11)]
print (list(map(lambda x: x*x, a)))
```
