# Вариативная самостоятельная работа

### [3.1. Реализация программы-игры «Угадай число», в которой для вывода на экран информации использовать метод format.](https://repl.it/@PolinaLazebniko/Tema6-VSR-Zad31)
```python
"""
    Лазебникова Полина 
    ИВТ 2 курс
    группа 1.1

    Вариативная самостоятельная работа

    Задание 3.1: Реализовать программу-игру «Угадай число», в которой для вывода на экран 
    информации использовать метод format.  
"""

import random

print ("Игра 'Угадай число'") 
print ("Загадано число от 1 до 99")
print ("Дается 10 попыток, чтобы его угадать")
number = random.randint(1,99)
attempts = 0

while attempts < 10:
    print("Какое число загадано?")
    guess = int(input())
    attempts = attempts + 1
    if guess < number:
        print("Угадываемое число больше")
    if guess > number:
        print("Угадываемое число меньше")
    if guess == number:
        break
if guess == number:
    attempts = str(attempts)
    print("{}, ты угадал число! Количество попыток, которое тебе потребовалось: {}".format("Здорово", attempts))
if guess != number:
    number = str(number)
    print("{}, но попыток не осталось. Ты проиграл. Я загадал число {}".format("Жаль", number))
```
### [3.2. Программа, выводящая на экран последовательно символы английского и кириллического алфавита с использованием кодов из таблицы unicode-символов.](https://repl.it/@PolinaLazebniko/Tema5-VSR-Zad22)
```python
"""
    Лазебникова Полина 
    ИВТ 2 курс
    группа 1.1

    Вариативная самостоятельная работа

    Задание 3.2: Написать программу, выводящую на экран последовательно символы английского
    и кириллического алфавита с использованием кодов из таблицы unicode-символов. 
"""

def abc(a,b):
    """
    Функция для вывода символов английского и кириллического алфавита с использованием
    кодов из таблицы unicode-символов

    Входные данные - код первого и последнего символов для каждого алфавита
    Выходные данные - символы алфавита 

    Преобразует код из таблицы unicode-символов и выводит сам символ.
    """
    for i in range(a,b):
        print (chr(i), end=' ')

print('EN capital letters:')
print(abc(65,91))
print('EN small letters:')
print(abc(97,123))
print('RU capital letters:')
print(abc(1040,1072))
print('RU small letters:')
print(abc(1072,1104))
```
